english/show.md

# Table of Contents

-   [语义](#orgf7f84a0)
-   [短语](#orge217655)

显示给谁看？


<a id="orgf7f84a0"></a>

# 语义


## 给&#x2026;看

The children proudly showed me their presents.


## 证明

Figures showed a 9% rise in inflation.


## 表现出

Think positively and show some determination.


## 解释

Show me how the gun works.


## 显示

I want a photograph that shows his face.


## 带领

Can you show Mrs Davies to the bathroom?


## 指向

Can you show me exactly where he fell?


## 放映

The film was shown on television last night.


## 被看见

His happiness showed in his face.


## 容易显出

Light-coloured clothes tend to show the dirt.


## 表明

The price of players is the reason why many football clubs show big losses on their balance sheets.


## 展示

Her recent **sculptures** are being shown at the Hayward Gallery.


## 安排比赛

Do you plan to show your dogs?


## 到场

I went to meet Hank, but he never showed.


## 演出

I enjoyed the show immensely.


## 节目

The **senator** appeared on the CBS show 'Face the Nation'.


## 展览会

Kelly has a show of her latest work opening shortly.


## 假装

Susan put on a show of regret all day.


## 美好景象

Maple trees put on their best show in the autumn.


## 展评会

The dog show was being held in the Agricultural Hall.


## 活动

We need to find someone to run the show.


<a id="orge217655"></a>

# 短语


## have something to show for something

If he fails, he'll have nothing to show for his time at school.

<https://youglish.com/getbyid/65863769/have%20nothing%20to%20show/english>


## show your face

She never shows her face around here.

<https://youglish.com/getbyid/28272653/show%20your%20face/english>


## show your hand

There were so many **rumours** that the company was farced to show its hand.

<https://youglish.com/getbyid/94692671/show%20its%20hand/english>


## show somebody in a good light

During an interview, you need to show yourself in the best possible light.

<https://youglish.com/getbyid/68815937/show%20in%20a%20good%20light/english>


## on show

The designer clothes will go on show in Chicago next month.

<https://youglish.com/getbyid/76385664/on%20show/english>


## a show of something

I felt I should make a show of **dignity**.

<https://youglish.com/getbyid/34504249/a%20show%20of/english>


## show of hands

Russell then asked for a show of hands concerning each of the targets.

<https://youglish.com/getbyid/32203143/a%20show%20of/english>


## for show

He does actually play his guitar - it's not just for show.

<https://youglish.com/getbyid/13634065/for%20show/english>
